## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # module.aad_pod_identity_access_policy.azurerm_key_vault_access_policy.kv_access_policy will be created
  + resource "azurerm_key_vault_access_policy" "kv_access_policy" {
      + id                 = (known after apply)
      + key_vault_id       = (known after apply)
      + object_id          = (known after apply)
      + secret_permissions = [
          + "Get",
          + "List",
        ]
      + tenant_id          = "48c383d8-47c5-48f9-9e8b-afe4f2519054"
    }

  # module.acr.azurerm_container_registry.acr will be created
  + resource "azurerm_container_registry" "acr" {
      + admin_enabled                 = true
      + admin_password                = (sensitive value)
      + admin_username                = (known after apply)
      + encryption                    = (known after apply)
      + export_policy_enabled         = true
      + id                            = (known after apply)
      + location                      = "northeurope"
      + login_server                  = (known after apply)
      + name                          = "prvaksacr"
      + network_rule_bypass_option    = "AzureServices"
      + network_rule_set              = (known after apply)
      + public_network_access_enabled = false
      + resource_group_name           = "aztf-spoke-rg"
      + sku                           = "Premium"
      + tags                          = {
          + "Environment" = "Dev"
          + "Owner"       = "kmiszel"
          + "Source"      = "Terraform"
        }
      + trust_policy_enabled          = false
      + zone_redundancy_enabled       = false
    }

  # module.acr.azurerm_private_endpoint.acr-endpoint will be created
  + resource "azurerm_private_endpoint" "acr-endpoint" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "northeurope"
      + name                     = "prvaksacr-to_aks"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "aztf-spoke-rg"
      + subnet_id                = "/subscriptions/456fb512-af18-4d07-861c-3ee54eae9181/resourceGroups/aztf-spoke-rg/providers/Microsoft.Network/virtualNetworks/aztf-spoke-vnet/subnets/akssubnet"
      + tags                     = {
          + "Environment" = "Dev"
          + "Owner"       = "kmiszel"
          + "Source"      = "Terraform"
        }

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "acr-endpoint-zone"
          + private_dns_zone_ids = (known after apply)
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "prvaksacr-privateserviceconnection"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "registry",
            ]
        }
    }

  # module.acr_dns_zone.azurerm_private_dns_zone.dns_zone will be created
  + resource "azurerm_private_dns_zone" "dns_zone" {
      + id                                                    = (known after apply)
      + max_number_of_record_sets                             = (known after apply)
      + max_number_of_virtual_network_links                   = (known after apply)
      + max_number_of_virtual_network_links_with_registration = (known after apply)
      + name                                                  = "privatelink.azurecr.io"
      + number_of_record_sets                                 = (known after apply)
      + resource_group_name                                   = "aztf-spoke-rg"
      + tags                                                  = {
          + "Environment" = "Dev"
          + "Owner"       = "kmiszel"
          + "Source"      = "Terraform"
        }

      + soa_record (known after apply)
    }

  # module.acr_dns_zone.azurerm_private_dns_zone_virtual_network_link.vnet_link will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "spoke_to_acrs"
      + private_dns_zone_name = "privatelink.azurecr.io"
      + registration_enabled  = false
      + resource_group_name   = "aztf-spoke-rg"
      + tags                  = {
          + "Environment" = "Dev"
          + "Owner"       = "kmiszel"
          + "Source"      = "Terraform"
        }
      + virtual_network_id    = "/subscriptions/456fb512-af18-4d07-861c-3ee54eae9181/resourceGroups/aztf-spoke-rg/providers/Microsoft.Network/virtualNetworks/aztf-spoke-vnet"
    }

  # module.aks["blue"].azurerm_kubernetes_cluster.akscluster will be created
  + resource "azurerm_kubernetes_cluster" "akscluster" {
      + automatic_upgrade_channel           = "patch"
      + azure_policy_enabled                = true
      + current_kubernetes_version          = (known after apply)
      + dns_prefix                          = "prvaks-blue"
      + fqdn                                = (known after apply)
      + http_application_routing_zone_name  = (known after apply)
      + id                                  = (known after apply)
      + image_cleaner_enabled               = true
      + image_cleaner_interval_hours        = 168
      + kube_admin_config                   = (sensitive value)
      + kube_admin_config_raw               = (sensitive value)
      + kube_config                         = (sensitive value)
      + kube_config_raw                     = (sensitive value)
      + kubernetes_version                  = "1.29"
      + location                            = "northeurope"
      + name                                = "prvaks-blue"
      + node_os_upgrade_channel             = "NodeImage"
      + node_resource_group                 = (known after apply)
      + node_resource_group_id              = (known after apply)
      + oidc_issuer_url                     = (known after apply)
      + portal_fqdn                         = (known after apply)
      + private_cluster_enabled             = true
      + private_cluster_public_fqdn_enabled = false
      + private_dns_zone_id                 = (known after apply)
      + private_fqdn                        = (known after apply)
      + resource_group_name                 = "aztf-spoke-rg"
      + role_based_access_control_enabled   = true
      + run_command_enabled                 = true
      + sku_tier                            = "Free"
      + support_plan                        = "KubernetesOfficial"
      + tags                                = {
          + "Environment" = "Dev"
          + "Owner"       = "kmiszel"
          + "Source"      = "Terraform"
        }
      + workload_identity_enabled           = false

      + auto_scaler_profile (known after apply)

      + azure_active_directory_role_based_access_control {
          + admin_group_object_ids = (known after apply)
          + azure_rbac_enabled     = true
          + tenant_id              = (known after apply)
        }

      + default_node_pool {
          + kubelet_disk_type           = (known after apply)
          + max_count                   = 3
          + max_pods                    = 30
          + min_count                   = 2
          + name                        = "defaultpool"
          + node_count                  = 2
          + node_labels                 = (known after apply)
          + orchestrator_version        = (known after apply)
          + os_disk_size_gb             = 30
          + os_disk_type                = "Managed"
          + os_sku                      = (known after apply)
          + scale_down_mode             = "Delete"
          + temporary_name_for_rotation = "temppool"
          + type                        = "VirtualMachineScaleSets"
          + ultra_ssd_enabled           = false
          + vm_size                     = "Standard_DS2_v2"
          + vnet_subnet_id              = "/subscriptions/456fb512-af18-4d07-861c-3ee54eae9181/resourceGroups/aztf-spoke-rg/providers/Microsoft.Network/virtualNetworks/aztf-spoke-vnet/subnets/akssubnet"
          + workload_runtime            = (known after apply)

          + upgrade_settings {
              + drain_timeout_in_minutes      = 0
              + max_surge                     = "10%"
              + node_soak_duration_in_minutes = 0
            }
        }

      + identity {
          + identity_ids = (known after apply)
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "UserAssigned"
        }

      + ingress_application_gateway {
          + effective_gateway_id                 = (known after apply)
          + gateway_id                           = (known after apply)
          + ingress_application_gateway_identity = (known after apply)
        }

      + key_vault_secrets_provider {
          + secret_identity          = (known after apply)
          + secret_rotation_enabled  = false
          + secret_rotation_interval = "2m"
        }

      + kubelet_identity (known after apply)

      + maintenance_window_auto_upgrade {
          + day_of_week = "Sunday"
          + duration    = 4
          + frequency   = "Weekly"
          + interval    = 1
          + start_date  = "2024-10-22T00:00:00Z"
          + start_time  = "00:00"
          + utc_offset  = "+00:00"
        }

      + maintenance_window_node_os {
          + day_of_week = "Sunday"
          + duration    = 4
          + frequency   = "Weekly"
          + interval    = 1
          + start_date  = "2024-10-22T00:00:00Z"
          + start_time  = "00:00"
          + utc_offset  = "+00:00"
        }

      + monitor_metrics {}

      + network_profile {
          + dns_service_ip     = "192.168.100.10"
          + ip_versions        = (known after apply)
          + load_balancer_sku  = "standard"
          + network_data_plane = "azure"
          + network_mode       = (known after apply)
          + network_plugin     = "azure"
          + network_policy     = (known after apply)
          + outbound_type      = "userDefinedRouting"
          + pod_cidr           = (known after apply)
          + pod_cidrs          = (known after apply)
          + service_cidr       = "192.168.100.0/24"
          + service_cidrs      = (known after apply)

          + load_balancer_profile (known after apply)

          + nat_gateway_profile (known after apply)
        }

      + oms_agent {
          + log_analytics_workspace_id      = (known after apply)
          + msi_auth_for_monitoring_enabled = true
          + oms_agent_identity              = (known after apply)
        }

      + windows_profile (known after apply)
    }

  # module.aks_dns_zone.azurerm_private_dns_zone.dns_zone will be created
  + resource "azurerm_private_dns_zone" "dns_zone" {
      + id                                                    = (known after apply)
      + max_number_of_record_sets                             = (known after apply)
      + max_number_of_virtual_network_links                   = (known after apply)
      + max_number_of_virtual_network_links_with_registration = (known after apply)
      + name                                                  = "privatelink.northeurope.azmk8s.io"
      + number_of_record_sets                                 = (known after apply)
      + resource_group_name                                   = "aztf-spoke-rg"
      + tags                                                  = {
          + "Environment" = "Dev"
          + "Owner"       = "kmiszel"
          + "Source"      = "Terraform"
        }

      + soa_record (known after apply)
    }

  # module.aks_dns_zone.azurerm_private_dns_zone_virtual_network_link.vnet_link will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "hub_to_aks"
      + private_dns_zone_name = "privatelink.northeurope.azmk8s.io"
      + registration_enabled  = false
      + resource_group_name   = "aztf-spoke-rg"
      + tags                  = {
          + "Environment" = "Dev"
          + "Owner"       = "kmiszel"
          + "Source"      = "Terraform"
        }
      + virtual_network_id    = "/subscriptions/1c7e8402-ac8b-48d9-a8c8-f3de95064482/resourceGroups/aztf-hub-rg/providers/Microsoft.Network/virtualNetworks/aztf-hub-vnet"
    }

  # module.aks_eid_groups.azuread_group.aksadmins will be created
  + resource "azuread_group" "aksadmins" {
      + auto_subscribe_new_members     = (known after apply)
      + display_name                   = "AKS Admins Team"
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_group_type          = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + prevent_duplicate_names        = false
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + visibility                     = (known after apply)
      + writeback_enabled              = false
    }

  # module.aks_eid_groups.azuread_group.aksusers will be created
  + resource "azuread_group" "aksusers" {
      + auto_subscribe_new_members     = (known after apply)
      + display_name                   = "AKS Devs Team"
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_group_type          = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + prevent_duplicate_names        = false
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + visibility                     = (known after apply)
      + writeback_enabled              = false
    }

  # module.appgw["blue"].azurerm_application_gateway.agw will be created
  + resource "azurerm_application_gateway" "agw" {
      + id                          = (known after apply)
      + location                    = "northeurope"
      + name                        = "blue-appgw"
      + private_endpoint_connection = (known after apply)
      + resource_group_name         = "aztf-spoke-rg"
      + tags                        = {
          + "Environment" = "Dev"
          + "Owner"       = "kmiszel"
          + "Source"      = "Terraform"
        }

      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = []
          + name         = "aztf-spoke-vnet-beap"
        }

      + backend_http_settings {
          + cookie_based_affinity               = "Disabled"
          + id                                  = (known after apply)
          + name                                = "aztf-spoke-vnet-be-htst"
          + path                                = "/path1/"
          + pick_host_name_from_backend_address = false
          + port                                = 80
          + probe_id                            = (known after apply)
          + protocol                            = "Http"
          + request_timeout                     = 60
          + trusted_root_certificate_names      = []
            # (3 unchanged attributes hidden)
        }

      + frontend_ip_configuration {
          + id                            = (known after apply)
          + name                          = "aztf-spoke-vnet-feip"
          + private_ip_address            = (known after apply)
          + private_ip_address_allocation = "Dynamic"
          + private_link_configuration_id = (known after apply)
          + public_ip_address_id          = (known after apply)
        }

      + frontend_port {
          + id   = (known after apply)
          + name = "aztf-spoke-vnet-feport"
          + port = 80
        }

      + gateway_ip_configuration {
          + id        = (known after apply)
          + name      = "app-gateway-ip-configuration"
          + subnet_id = "/subscriptions/456fb512-af18-4d07-861c-3ee54eae9181/resourceGroups/aztf-spoke-rg/providers/Microsoft.Network/virtualNetworks/aztf-spoke-vnet/subnets/appgwsubnet"
        }

      + http_listener {
          + frontend_ip_configuration_id   = (known after apply)
          + frontend_ip_configuration_name = "aztf-spoke-vnet-feip"
          + frontend_port_id               = (known after apply)
          + frontend_port_name             = "aztf-spoke-vnet-feport"
          + host_names                     = []
          + id                             = (known after apply)
          + name                           = "aztf-spoke-vnet-httplstn"
          + protocol                       = "Http"
          + ssl_certificate_id             = (known after apply)
          + ssl_profile_id                 = (known after apply)
            # (4 unchanged attributes hidden)
        }

      + request_routing_rule {
          + backend_address_pool_id     = (known after apply)
          + backend_address_pool_name   = "aztf-spoke-vnet-beap"
          + backend_http_settings_id    = (known after apply)
          + backend_http_settings_name  = "aztf-spoke-vnet-be-htst"
          + http_listener_id            = (known after apply)
          + http_listener_name          = "aztf-spoke-vnet-httplstn"
          + id                          = (known after apply)
          + name                        = "aztf-spoke-vnet-rqrt"
          + priority                    = 1
          + redirect_configuration_id   = (known after apply)
          + rewrite_rule_set_id         = (known after apply)
          + rule_type                   = "Basic"
          + url_path_map_id             = (known after apply)
            # (3 unchanged attributes hidden)
        }

      + sku {
          + capacity = 2
          + name     = "WAF_v2"
          + tier     = "WAF_v2"
        }

      + ssl_policy (known after apply)

      + waf_configuration {
          + enabled                  = true
          + file_upload_limit_mb     = 100
          + firewall_mode            = "Detection"
          + max_request_body_size_kb = 128
          + request_body_check       = true
          + rule_set_type            = "OWASP"
          + rule_set_version         = "3.2"
        }
    }

  # module.appgw_nsg.azurerm_network_security_group.appgw-nsg will be created
  + resource "azurerm_network_security_group" "appgw-nsg" {
      + id                  = (known after apply)
      + location            = "northeurope"
      + name                = "aztf-spoke-vnet-appgw-nsg"
      + resource_group_name = "aztf-spoke-rg"
      + security_rule       = (known after apply)
      + tags                = {
          + "Environment" = "Dev"
          + "Owner"       = "kmiszel"
          + "Source"      = "Terraform"
        }
    }

  # module.appgw_nsg.azurerm_network_security_rule.DenyAllInBound will be created
  + resource "azurerm_network_security_rule" "DenyAllInBound" {
      + access                      = "Deny"
      + destination_address_prefix  = "*"
      + destination_port_range      = "*"
      + direction                   = "Inbound"
      + id                          = (known after apply)
      + name                        = "DenyAllInBound"
      + network_security_group_name = "aztf-spoke-vnet-appgw-nsg"
      + priority                    = 1000
      + protocol                    = "*"
      + resource_group_name         = "aztf-spoke-rg"
      + source_address_prefix       = "*"
      + source_port_range           = "*"
    }

  # module.appgw_nsg.azurerm_network_security_rule.controlplane will be created
  + resource "azurerm_network_security_rule" "controlplane" {
      + access                      = "Allow"
      + destination_address_prefix  = "*"
      + destination_port_range      = "65200-65535"
      + direction                   = "Inbound"
      + id                          = (known after apply)
      + name                        = "AllowControlPlane"
      + network_security_group_name = "aztf-spoke-vnet-appgw-nsg"
      + priority                    = 110
      + protocol                    = "*"
      + resource_group_name         = "aztf-spoke-rg"
      + source_address_prefix       = "*"
      + source_port_range           = "*"
    }

  # module.appgw_nsg.azurerm_network_security_rule.healthprobes will be created
  + resource "azurerm_network_security_rule" "healthprobes" {
      + access                      = "Allow"
      + destination_address_prefix  = "VirtualNetwork"
      + destination_port_range      = "*"
      + direction                   = "Inbound"
      + id                          = (known after apply)
      + name                        = "AllowHealthProbes"
      + network_security_group_name = "aztf-spoke-vnet-appgw-nsg"
      + priority                    = 120
      + protocol                    = "*"
      + resource_group_name         = "aztf-spoke-rg"
      + source_address_prefix       = "AzureLoadBalancer"
      + source_port_range           = "*"
    }

  # module.appgw_nsg.azurerm_network_security_rule.inboundhttps will be created
  + resource "azurerm_network_security_rule" "inboundhttps" {
      + access                      = "Allow"
      + destination_address_prefix  = "VirtualNetwork"
      + destination_port_range      = "443"
      + direction                   = "Inbound"
      + id                          = (known after apply)
      + name                        = "Allow443InBound"
      + network_security_group_name = "aztf-spoke-vnet-appgw-nsg"
      + priority                    = 100
      + protocol                    = "Tcp"
      + resource_group_name         = "aztf-spoke-rg"
      + source_address_prefix       = "Internet"
      + source_port_range           = "*"
    }

  # module.appgw_nsg.azurerm_subnet_network_security_group_association.appgwassoc will be created
  + resource "azurerm_subnet_network_security_group_association" "appgwassoc" {
      + id                        = (known after apply)
      + network_security_group_id = (known after apply)
      + subnet_id                 = "/subscriptions/456fb512-af18-4d07-861c-3ee54eae9181/resourceGroups/aztf-spoke-rg/providers/Microsoft.Network/virtualNetworks/aztf-spoke-vnet/subnets/appgwsubnet"
    }

  # module.eid_role_assignment-aks_admins["blue"].azurerm_role_assignment.eid_group_assignment["0"] will be created
  + resource "azurerm_role_assignment" "eid_group_assignment" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Azure Kubernetes Service RBAC Cluster Admin"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.eid_role_assignment-aks_rbac_admin["blue"].azurerm_role_assignment.eid_group_assignment["0"] will be created
  + resource "azurerm_role_assignment" "eid_group_assignment" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "8bd22a44-7497-4eda-b790-c9d2b4e84d4d"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Azure Kubernetes Service RBAC Cluster Admin"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.eid_role_assignment-aks_users["blue"].azurerm_role_assignment.eid_group_assignment["0"] will be created
  + resource "azurerm_role_assignment" "eid_group_assignment" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Azure Kubernetes Service Cluster User Role"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.kv.data.azurerm_client_config.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_client_config" "current" {
      + client_id       = (known after apply)
      + id              = (known after apply)
      + object_id       = (known after apply)
      + subscription_id = (known after apply)
      + tenant_id       = (known after apply)
    }

  # module.kv.azurerm_key_vault.key-vault will be created
  + resource "azurerm_key_vault" "key-vault" {
      + access_policy                 = (known after apply)
      + enabled_for_disk_encryption   = true
      + id                            = (known after apply)
      + location                      = "northeurope"
      + name                          = "prvakskv"
      + public_network_access_enabled = true
      + purge_protection_enabled      = false
      + resource_group_name           = "aztf-spoke-rg"
      + sku_name                      = "standard"
      + soft_delete_retention_days    = 7
      + tags                          = {
          + "Environment" = "Dev"
          + "Owner"       = "kmiszel"
          + "Source"      = "Terraform"
        }
      + tenant_id                     = (known after apply)
      + vault_uri                     = (known after apply)

      + contact (known after apply)

      + network_acls {
          + bypass         = "AzureServices"
          + default_action = "Deny"
        }
    }

  # module.kv.azurerm_private_endpoint.kv-endpoint will be created
  + resource "azurerm_private_endpoint" "kv-endpoint" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "northeurope"
      + name                     = "prvakskv-endpoint"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "aztf-spoke-rg"
      + subnet_id                = "/subscriptions/456fb512-af18-4d07-861c-3ee54eae9181/resourceGroups/aztf-spoke-rg/providers/Microsoft.Network/virtualNetworks/aztf-spoke-vnet/subnets/akssubnet"
      + tags                     = {
          + "Environment" = "Dev"
          + "Owner"       = "kmiszel"
          + "Source"      = "Terraform"
        }

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "kv-endpoint-zone"
          + private_dns_zone_ids = (known after apply)
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "prvakskv-privateserviceconnection"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "vault",
            ]
        }
    }

  # module.kv_dns_zone.azurerm_private_dns_zone.dns_zone will be created
  + resource "azurerm_private_dns_zone" "dns_zone" {
      + id                                                    = (known after apply)
      + max_number_of_record_sets                             = (known after apply)
      + max_number_of_virtual_network_links                   = (known after apply)
      + max_number_of_virtual_network_links_with_registration = (known after apply)
      + name                                                  = "privatelink.vaultcore.azure.net"
      + number_of_record_sets                                 = (known after apply)
      + resource_group_name                                   = "aztf-spoke-rg"
      + tags                                                  = {
          + "Environment" = "Dev"
          + "Owner"       = "kmiszel"
          + "Source"      = "Terraform"
        }

      + soa_record (known after apply)
    }

  # module.kv_dns_zone.azurerm_private_dns_zone_virtual_network_link.vnet_link will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "spoke_to_kvs"
      + private_dns_zone_name = "privatelink.vaultcore.azure.net"
      + registration_enabled  = false
      + resource_group_name   = "aztf-spoke-rg"
      + tags                  = {
          + "Environment" = "Dev"
          + "Owner"       = "kmiszel"
          + "Source"      = "Terraform"
        }
      + virtual_network_id    = "/subscriptions/456fb512-af18-4d07-861c-3ee54eae9181/resourceGroups/aztf-spoke-rg/providers/Microsoft.Network/virtualNetworks/aztf-spoke-vnet"
    }

  # module.laws.azurerm_log_analytics_workspace.laws will be created
  + resource "azurerm_log_analytics_workspace" "laws" {
      + allow_resource_only_permissions = true
      + daily_quota_gb                  = -1
      + id                              = (known after apply)
      + internet_ingestion_enabled      = true
      + internet_query_enabled          = true
      + local_authentication_disabled   = false
      + location                        = "northeurope"
      + name                            = "prvaks-laws"
      + primary_shared_key              = (sensitive value)
      + resource_group_name             = "aztf-spoke-rg"
      + retention_in_days               = 30
      + secondary_shared_key            = (sensitive value)
      + sku                             = "PerGB2018"
      + tags                            = {
          + "Environment" = "Dev"
          + "Owner"       = "kmiszel"
          + "Source"      = "Terraform"
        }
      + workspace_id                    = (known after apply)
    }

  # module.pip["blue"].azurerm_public_ip.pip will be created
  + resource "azurerm_public_ip" "pip" {
      + allocation_method       = "Static"
      + ddos_protection_mode    = "VirtualNetworkInherited"
      + fqdn                    = (known after apply)
      + id                      = (known after apply)
      + idle_timeout_in_minutes = 4
      + ip_address              = (known after apply)
      + ip_version              = "IPv4"
      + location                = "northeurope"
      + name                    = "blue-appgw-pip"
      + resource_group_name     = "aztf-spoke-rg"
      + sku                     = "Standard"
      + sku_tier                = "Regional"
      + tags                    = {
          + "Environment" = "Dev"
          + "Owner"       = "kmiszel"
          + "Source"      = "Terraform"
        }
    }

  # module.role_assignment_agic_appgw["blue"].azurerm_role_assignment.assignment["blue"] will be created
  + resource "azurerm_role_assignment" "assignment" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.role_assignment_aks-to-acr["blue"].azurerm_role_assignment.assignment["blue"] will be created
  + resource "azurerm_role_assignment" "assignment" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "AcrPull"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.role_assignment_aks-to-dnszone["blue"].azurerm_role_assignment.assignment["blue"] will be created
  + resource "azurerm_role_assignment" "assignment" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Private DNS Zone Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.role_assignment_aks-to-rt["blue"].azurerm_role_assignment.assignment["blue"] will be created
  + resource "azurerm_role_assignment" "assignment" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Contributor"
      + scope                            = "/subscriptions/456fb512-af18-4d07-861c-3ee54eae9181/resourceGroups/aztf-spoke-rg/providers/Microsoft.Network/routeTables/aztf-spoke-rt"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.role_assignment_aks-to-vnet["blue"].azurerm_role_assignment.assignment["blue"] will be created
  + resource "azurerm_role_assignment" "assignment" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Network Contributor"
      + scope                            = "/subscriptions/456fb512-af18-4d07-861c-3ee54eae9181/resourceGroups/aztf-spoke-rg/providers/Microsoft.Network/virtualNetworks/aztf-spoke-vnet"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.role_assignment_aks_identity_operator["blue"].azurerm_role_assignment.assignment["blue"] will be created
  + resource "azurerm_role_assignment" "assignment" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Managed Identity Operator"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.role_assignment_aks_vm_contributor["blue"].azurerm_role_assignment.assignment["blue"] will be created
  + resource "azurerm_role_assignment" "assignment" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Virtual Machine Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.uami_aks_cp["blue"].azurerm_user_assigned_identity.uami will be created
  + resource "azurerm_user_assigned_identity" "uami" {
      + client_id           = (known after apply)
      + id                  = (known after apply)
      + location            = "northeurope"
      + name                = "prvaksblue-mi-cp"
      + principal_id        = (known after apply)
      + resource_group_name = "aztf-spoke-rg"
      + tags                = {
          + "Environment" = "Dev"
          + "Owner"       = "kmiszel"
          + "Source"      = "Terraform"
        }
      + tenant_id           = (known after apply)
    }

  # module.uami_aks_pod.azurerm_user_assigned_identity.uami will be created
  + resource "azurerm_user_assigned_identity" "uami" {
      + client_id           = (known after apply)
      + id                  = (known after apply)
      + location            = "northeurope"
      + name                = "pod-identity"
      + principal_id        = (known after apply)
      + resource_group_name = "aztf-spoke-rg"
      + tags                = {
          + "Environment" = "Dev"
          + "Owner"       = "kmiszel"
          + "Source"      = "Terraform"
        }
      + tenant_id           = (known after apply)
    }

Plan: 35 to add, 0 to change, 0 to destroy.
```
</details>